#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Shafiul-Shop/relay42/runs/run-e3uZX7mp9HzFkWwt

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-092579ba243d3924e]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0686dd1a1b1674f92]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-031245b03afca330b]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-0eefb9bbf944ad726]
module.vpc.aws_vpc_ipv4_cidr_block_association.this[1]: Refreshing state... [id=vpc-cidr-assoc-05d731301067254e4]
module.loadbalancer_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0c435b32cdd4d880a]
module.application_ec2_multiple_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03b67676aefdc6a35]
module.ec2_bastion_prod_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b06f531046549963]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01a878219aff66a2c]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c08d6723ea7eb2a7]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-03e7b8255d29a93a4]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-00a7c393f31acd4ca]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ee7c3657a0163f88]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0650b0727bd4e1f8e]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0745b0f1ecae980ee]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0056896f4bc59b861]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-028b197b707d7fabd]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-09ef6c97c532eb2bf]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06a163854410fb83b]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-07a0a640537b3cabb]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0fa709155b04e100d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00f81763bd323f0f2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c08d6723ea7eb2a71080289494]
module.application_ec2_multiple_sg.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3724887445]
module.application_ec2_multiple_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1386085501]
module.application_ec2_multiple_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1422298045]
module.loadbalancer_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1730530921]
module.loadbalancer_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1132359896]
module.ec2_bastion_prod_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1141659139]
module.ec2_bastion_prod_sg.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-765909566]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=vpc-prod]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0080e04fb141060a1]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03d7fe0d37042af61]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0342ba74ddcecaa18]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c97c9d82319b0490]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-0ff488c1b57a16ae5]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-024b100dc3267d2e8]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-044ce843ffec5036d]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dd2a4864e0344953]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0af58a7f8b13b71f1]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0778167a655a35abe]
module.ec2_bastion_prod.aws_instance.this[0]: Refreshing state... [id=i-0ce63ed03c63a2853]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:loadbalancer/app/IT-prod-alb/5864dd81cd40b25e]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-03e7b8255d29a93a41080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06a163854410fb83b1080289494]
module.application_ec2_multiple["app2"].aws_instance.this[0]: Refreshing state... [id=i-0330120b2851d5b17]
module.application_ec2_multiple["app1"].aws_instance.this[0]: Refreshing state... [id=i-02cf23c3ae4562942]
aws_eip.prod-bastion-eip: Refreshing state... [id=eipalloc-07425e29d8360a752]
module.alb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23]
module.alb.aws_lb_target_group_attachment.this["0.1"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23-20220320064413439200000006]
module.alb.aws_lb_target_group_attachment.this["0.0"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:targetgroup/app-20220320064410603000000004/c2d1e75e50b5aa23-20220320064412868700000005]
module.alb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:499618069435:listener/app/IT-prod-alb/5864dd81cd40b25e/80098885545b0e50]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.application_ec2_multiple_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-03b67676aefdc6a35"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.100.0.0/20",
                ]
              + description      = "HTTP"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          + {
              + cidr_blocks      = [
                  + "10.100.0.0/20",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "private-ec2-sg-20220320064039371100000003"
        tags                   = {
            "Name"        = "private-ec2-sg"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.application_ec2_multiple_sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-1422298045"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.ec2_bastion_prod.aws_instance.this[0] has changed
  ~ resource "aws_instance" "this" {
        id                                   = "i-0ce63ed03c63a2853"
      ~ public_dns                           = "ec2-35-161-175-207.us-west-2.compute.amazonaws.com" -> "ec2-100-21-93-172.us-west-2.compute.amazonaws.com"
      ~ public_ip                            = "35.161.175.207" -> "100.21.93.172"
        tags                                 = {
            "Name"        = "Production BastionHost"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (28 unchanged attributes hidden)






        # (6 unchanged blocks hidden)
    }

  # module.ec2_bastion_prod_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0b06f531046549963"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "public-prod-bastion-sg-20220320064039363200000001"
        tags                   = {
            "Name"        = "public-prod-bastion-sg"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ec2_bastion_prod_sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-1141659139"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.loadbalancer_sg.aws_security_group.this_name_prefix[0] has changed
  ~ resource "aws_security_group" "this_name_prefix" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All protocols"
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        id                     = "sg-0c435b32cdd4d880a"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        name                   = "loadbalancer-sg-20220320064039368700000002"
        tags                   = {
            "Name"        = "loadbalancer-sg"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.loadbalancer_sg.aws_security_group_rule.egress_rules[0] has changed
  ~ resource "aws_security_group_rule" "egress_rules" {
      ~ from_port         = -1 -> 0
        id                = "sgrule-1132359896"
      ~ to_port           = -1 -> 0
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-0ee30e380e8ff420a"
        id                   = "eipalloc-031245b03afca330b"
      + network_interface    = "eni-04bb405dd3378c2e3"
      + private_dns          = "ip-10-100-1-4.us-west-2.compute.internal"
      + private_ip           = "10.100.1.4"
        tags                 = {
            "Name"        = "vpc-prod-us-west-2a"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] has changed
  ~ resource "aws_eip" "nat" {
      + association_id       = "eipassoc-04191612c74aec059"
        id                   = "eipalloc-092579ba243d3924e"
      + network_interface    = "eni-0b6d57be44c5aea97"
      + private_dns          = "ip-10-100-2-172.us-west-2.compute.internal"
      + private_ip           = "10.100.2.172"
        tags                 = {
            "Name"        = "vpc-prod-us-west-2b"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-06a163854410fb83b"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0af58a7f8b13b71f1"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "vpc-prod-private-us-west-2a"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] has changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-03e7b8255d29a93a4"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = "nat-0778167a655a35abe"
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "vpc-prod-private-us-west-2b"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0c08d6723ea7eb2a7"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0ee7c3657a0163f88"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name"        = "vpc-prod-public"
            "environment" = "prod"
            "owners"      = "IT"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.alb_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "This metric monitors ALB HTTP 4xx errors counts if exceeds to 120"
      + alarm_name                            = "App-ALB-HTTP-4xx-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + datapoints_to_alarm                   = 2
      + dimensions                            = {
          + "LoadBalancer" = "app/IT-prod-alb/5864dd81cd40b25e"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_4XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 120
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.alb_sns_topic will be created
  + resource "aws_sns_topic" "alb_sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # aws_sns_topic_subscription.alb_sns_topic_subscription will be created
  + resource "aws_sns_topic_subscription" "alb_sns_topic_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "akmshasan@gmail.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id               = (known after apply)
      + length           = 8
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + override_special = "/@£$"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2_bastion_prod_public_ip = "35.161.175.207" -> "100.21.93.172"
  + lb_arn                     = "arn:aws:elasticloadbalancing:us-west-2:499618069435:loadbalancer/app/IT-prod-alb/5864dd81cd40b25e"
  + lb_arn_suffix              = "app/IT-prod-alb/5864dd81cd40b25e"
  + lb_id                      = "arn:aws:elasticloadbalancing:us-west-2:499618069435:loadbalancer/app/IT-prod-alb/5864dd81cd40b25e"

```
</details>
*Pusher: @akmshasan, Action: `pull_request`*